app/views/petitions/show.html.erb

SELECT "signatures".* FROM "signatures" WHERE "signatures"."petition_id" = ? AND (signatures.created_at > '2020-10-19 03:46:48.739536')  [["petition_id", 1]]
---

      <%= render @petition.signatures.where('signatures.created_at > ?', 1.week.ago).reverse %>