app/controllers/petitions_controller.rb

  def index
    @petitions = Petition.all
---
SELECT "petitions".* FROM "petitions"

  def create
    @petition = Petition.new(petition_params)

    respond_to do |format|
      if @petition.save
---
INSERT INTO "petitions" ("title", "slug", "body", "letter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "MyString"], ["slug", "mystring"], ["body", "MyText"], ["letter", "MyText"], ["created_at", "2020-10-26 01:52:47.676863"], ["updated_at", "2020-10-26 01:52:47.676863"]]

  def signatures
    display_name = params[:show_name] ? params[:name] : 'Anonymous'
    if @petition.signatures.create!(name: display_name)
      @petition.increment!(:total_signatures)
---
INSERT INTO "signatures" ("petition_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["petition_id", 1], ["name", "Eddy"], ["created_at", "2020-10-26 02:45:43.908665"], ["updated_at", "2020-10-26 02:45:43.908665"]]
UPDATE "petitions" SET "total_signatures" = COALESCE("total_signatures", 0) + 1 WHERE "petitions"."id" = ?  [["id", 1]]